<%@include file="Header.jsp"%>
<!DOCTYPE html>

<html>
<head>
     <title>הסבר על הפרויקט</title>
</head>
<גוף>
     <h1>ברוכים הבאים לדף הסבר הפרויקט</h1>
     <p>דף זה מספק סקירה כללית של הפרויקט ומטרתו.</p>
    
     <h2>פרטי הפרויקט</h2>
     <ul>
         <li>שם הפרויקט: Jsp-School-Senior-Project</li>
         <li>מיקום: /c:/Users/ronelgazar/Documents/school_2023-2024/cs/Ron_Elgazar_Project - חדש</li>
     </ul>
    
     <h2>מטרת הפרויקט</h2>
     <p>מטרת פרויקט זה היא לעזור לחברות קטנות (או צוותי רובוטיקה במקרה זה) לנהל את המשימות שלהן בצורה יעילה יחד עם מעקב אחר המשתמשים והמשימות שהושלמו על ידי כל אחד. מסד הנתונים הוא קובץ של Microsoft Access.</p>
    
     <h2>תכונות</h2>
     <p>הפרויקט כולל את התכונות הבאות:</p>
     <ul>
         <li>כניסה: המשתמש מזין שם משתמש וסיסמה ולכן יכול להיכנס אם האישורים נכונים.</li>
         <li>פרטי משתמש: מאפשר למשתמשים לצפות בפרופיל שלהם, לשנות את תמונת הפרופיל שלהם, להגדיר את הסיסמה ולעדכן אותה.</li>
         <li>הוספה או הסרה של משתמשים: ראשי קבוצות קיימים יכולים להוסיף את הכפופים להם למסד הנתונים, משתמשים יכולים להימחק ממסד הנתונים.</li>
         <li>משימות: ניתן להוסיף, להקצות ולהקצות משימות מחדש, להציג יחד עם הסטטוס ורמת העדיפות שלהן ולמחוק אותן.</li>
     </ul>
    
     <h2>סכימת מסד נתונים</h2>
     <p><img src="https://image.ibb.co/cbcR57/xd.png" alt="סכימת מסד נתונים"></p>
    
     <h2>מידע נוסף</h2>
     <p>לכל מידע נוסף או תמיכה, אנא צור קשר עם בעל הפרויקט.</p>
</body>
</html>